# Честь 1
# Задание 1

# Стандартное нормальное распределение
z_values <- qnorm(c(0.3, 0.5, 0.8, 0.368, 0.9, 0.95, 0.975, 0.98))
print(z_values)

# Распределение Стьюдента с 10 степенями свободы
t_values <- qt(c(0.9, 0.95, 0.975), df=10)
print(t_values)

# Хи-квадрат распределение с 15 степенями свободы
chi_squared_values <- qchisq(c(0.05, 0.1, 0.9, 0.95), df=15)
print(chi_squared_values)

# Распределение Фишера с (3, 5) степенями свободы
f_values <- qf(c(0.9, 0.95), df1=3, df2=5)
print(f_values)